app/controllers/users_controller.rb

INSERT INTO `users` (`last_login_at`, `last_request_at`, `updated_at`, `crypted_password`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `login`, `last_login_ip`, `created_at`) VALUES(NULL, NULL, '2009-03-23 18:37:16', '571c08e8862ae281afffdd29cff2b60f11f1d2b42d628383c4e9c225ef0a64abd4d3813ffd6348e18990b0d66fec5c95e19d6c60c624839e3099b285f93b88f0', '127.0.0.1', 'BOH1oaoTjHME0j0__-8H', '2009-03-23 18:37:16', 'ac12ba0c6a6be9eb23e8dc177ea2e15e2e088ab0d485dbcc13fa811cf0464453fecd5ea4dbe42ee8104895a3225128861385df024065b011e1d935f67a1de6b1', 1, 'PetrSmejkal', NULL, '2009-03-23 18:37:16')
---
  def create
    @user = User.new(params[:user])
    if @user.save